In [1]:
import pandas as pd

In [4]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

# Ans.

pd_sr = pd.Series([4, 8, 15, 16, 23, 42])
pd_sr

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [12]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.

# Ans.

l1 = list(range(1,11))

pd_sr2 = pd.Series(l1)
pd_sr2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [13]:
# Q3. Create a Pandas DataFrame that contains the following data:

# Name
# Alice
# Bob
# Claire

# Age
# 25
# 30
# 27

# Gender
# Female
# Male
# Female

# Ans.

d1 = {
    "Name":["Alice","Bob","Clarie"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}

df = pd.DataFrame(d1)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

In [ ]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

# Ans.

# Dataframe is a teo dimenssional labeled data-set.

# Series is a 1D Array where Dataframe is a 2D

In [15]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

# Ans.

# There are many function which we use to manipulate data in pandas
# head()
# tail()
# describe()
# shape()
# dropna()
# fillna()

# When in many rows data is not available then we can use dropna() to delete all those rows ,
# and we can use fillna() to fill those rows with particular data

In [ ]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

# Ans.

# Series and DataFrame :- Mutable
# Panel :- immutable

In [19]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

# Ans.

name_sr = pd.Series(["Nobita","Sizuka","Suniyo"])
age_sr = pd.Series([20,21,23])

d2 = {
    "Name":name_sr,
    "Age":age_sr
}

df2 = pd.DataFrame(d2)
df2

     Name  Age
0  Nobita   20
1  Sizuka   21
2  Suniyo   23